Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыРасчетаПроцентовПоСделкамРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаПроцентовПоСделкамРЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтавкеОтПервойЧастиРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРавномерномуРаспределениюПоДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнойСтавке</Name>
					<Comment>Газфонд</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Очищаем неиспользуемые ресурсы по условиям
	Для Каждого Запись Из ЭтотОбъект Цикл

		Если Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС = Истина Тогда
				
			Если ЗначениеЗаполнено(Запись.ВариантРасчетаПроцентовПоСделкамРЕПО) Тогда
				Запись.ВариантРасчетаПроцентовПоСделкамРЕПО = Неопределено;
			КонецЕсли;
			
			Если Запись.ТочностьРасчетнойСтавкиРЕПО <> 0 Тогда
				Запись.ТочностьРасчетнойСтавкиРЕПО = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Запись.КритерийСущественностиОтклоненияССТПлюс) Тогда
				Запись.КритерийСущественностиОтклоненияССТПлюс = 0;
			КонецЕсли;
			
		КонецЕсли;	 
				
		Если Запись.ВариантРасчетаПроцентовПоСделкамРЕПО <> Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
						 
			Если Запись.ТочностьРасчетнойСтавкиРЕПО <> 0 Тогда
				Запись.ТочностьРасчетнойСтавкиРЕПО = 0;
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеПроцентовПоРЕПО = РегистрыСведений.НастройкиФормированияСЧА.ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеСЧА();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Период < ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеПроцентовПоРЕПО
			Или Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС = Истина Тогда
			
			Если ПроверяемыеРеквизиты.Найти("ВариантРасчетаПроцентовПоСделкамРЕПО") <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВариантРасчетаПроцентовПоСделкамРЕПО"));
			КонецЕсли;
			
		КонецЕсли;	 
			
		Если Запись.ВариантРасчетаПроцентовПоСделкамРЕПО <> Перечисления.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке Тогда
						 
			Если ПроверяемыеРеквизиты.Найти("ТочностьРасчетнойСтавкиРЕПО") <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТочностьРасчетнойСтавкиРЕПО"));
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
